Magicoe/LPC55S3x_Test_code/example_code/lpc55s3x_mdk/drivers/fsl_power.c
/*
 * Copyright 2020, NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include <string.h>
#include "fsl_common.h"
#include "fsl_power.h"

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.power"
#endif

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/**
 * @brief LDO_FLASH_NV & LDO_EFUSE_PROG voltage settings
 */
typedef enum _v_ldo_flashnv_ldo_efuse
{
    V_LDO_1P650 = 0, /*!< 1.65  V */
    V_LDO_1P700 = 1, /*!< 1.7   V */
    V_LDO_1P750 = 2, /*!< 1.75  V */
    V_LDO_1P800 = 3, /*!< 1.8   V */
    V_LDO_1P850 = 4, /*!< 1.85  V */
    V_LDO_1P900 = 5, /*!< 1.9   V */
    V_LDO_1P950 = 6, /*!< 1.95  V */
    V_LDO_2P000 = 7  /*!< 2.0   V */
} v_ldo_flashnv_ldo_efuse_t;

/**
 * @brief Always On and Memories LDO voltage settings
 */
typedef enum _v_ao
{
    // V_AO_1P220 1.22  = 0,  /*!< 1.22  V */
    V_AO_0P700 = 1,  /*!< 0.7   V */
    V_AO_0P725 = 2,  /*!< 0.725 V */
    V_AO_0P750 = 3,  /*!< 0.75  V */
    V_AO_0P775 = 4,  /*!< 0.775 V */
    V_AO_0P800 = 5,  /*!< 0.8   V */
    V_AO_0P825 = 6,  /*!< 0.825 V */
    V_AO_0P850 = 7,  /*!< 0.85  V */
    V_AO_0P875 = 8,  /*!< 0.875 V */
    V_AO_0P900 = 9,  /*!< 0.9   V */
    V_AO_0P960 = 10, /*!< 0.96  V */
    V_AO_0P970 = 11, /*!< 0.97  V */
    V_AO_0P980 = 12, /*!< 0.98  V */
    V_AO_0P990 = 13, /*!< 0.99  V */
    V_AO_1P000 = 14, /*!< 1     V */
    V_AO_1P010 = 15, /*!< 1.01  V */
    V_AO_1P020 = 16, /*!< 1.02  V */
    V_AO_1P030 = 17, /*!< 1.03  V */
    V_AO_1P040 = 18, /*!< 1.04  V */
    V_AO_1P050 = 19, /*!< 1.05  V */
    V_AO_1P060 = 20, /*!< 1.06  V */
    V_AO_1P070 = 21, /*!< 1.07  V */
    V_AO_1P080 = 22, /*!< 1.08  V */
    V_AO_1P090 = 23, /*!< 1.09  V */
    V_AO_1P100 = 24, /*!< 1.1   V */
    V_AO_1P110 = 25, /*!< 1.11  V */
    V_AO_1P120 = 26, /*!< 1.12  V */
    V_AO_1P130 = 27, /*!< 1.13  V */
    V_AO_1P140 = 28, /*!< 1.14  V */
    V_AO_1P150 = 29, /*!< 1.15  V */
    V_AO_1P160 = 30, /*!< 1.16  V */
    V_AO_1P220 = 31  /*!< 1.22  V */
} v_ao_t;

/**
 * @brief DCDC voltage settings
 */
typedef enum _v_dcdc
{
    V_DCDC_0P950 = 0, /*!< 0.95  V */
    V_DCDC_0P975 = 1, /*!< 0.975 V */
    V_DCDC_1P000 = 2, /*!< 1     V */
    V_DCDC_1P025 = 3, /*!< 1.025 V */
    V_DCDC_1P050 = 4, /*!< 1.050 V */
    V_DCDC_1P075 = 5, /*!< 1.075 V */
    V_DCDC_1P100 = 6, /*!< 1.1   V */
    V_DCDC_1P125 = 7, /*!< 1.125 V */
    V_DCDC_1P150 = 8, /*!< 1.150 V */
    V_DCDC_1P175 = 9, /*!< 1.175 V */
    V_DCDC_1P200 = 10 /*!< 1.2   V */
} v_dcdc_t;

/**
 * @brief LDO_CORE High Power Mode voltage settings
 */
typedef enum _v_ldocore_hp
{
    V_LDOCORE_HP_1P373 = 0,  /*!< 1.373  V */
    V_LDOCORE_HP_1P365 = 1,  /*!< 1.365  V */
    V_LDOCORE_HP_1P359 = 2,  /*!< 1.359  V */
    V_LDOCORE_HP_1P352 = 3,  /*!< 1.352  V */
    V_LDOCORE_HP_1P345 = 4,  /*!< 1.345  V */
    V_LDOCORE_HP_1P339 = 5,  /*!< 1.339  V */
    V_LDOCORE_HP_1P332 = 6,  /*!< 1.332  V */
    V_LDOCORE_HP_1P325 = 7,  /*!< 1.325  V */
    V_LDOCORE_HP_1P318 = 8,  /*!< 1.318  V */
    V_LDOCORE_HP_1P311 = 9,  /*!< 1.311  V */
    V_LDOCORE_HP_1P305 = 10, /*!< 1.305  V */
    V_LDOCORE_HP_1P298 = 11, /*!< 1.298  V */
    V_LDOCORE_HP_1P291 = 12, /*!< 1.291  V */
    V_LDOCORE_HP_1P285 = 13, /*!< 1.285  V */
    V_LDOCORE_HP_1P278 = 14, /*!< 1.278  V */
    V_LDOCORE_HP_1P271 = 15, /*!< 1.271  V */
    V_LDOCORE_HP_1P264 = 16, /*!< 1.264  V */
    V_LDOCORE_HP_1P258 = 17, /*!< 1.258  V */
    V_LDOCORE_HP_1P251 = 18, /*!< 1.251  V */
    V_LDOCORE_HP_1P244 = 19, /*!< 1.244  V */
    V_LDOCORE_HP_1P237 = 20, /*!< 1.237  V */
    V_LDOCORE_HP_1P231 = 21, /*!< 1.231  V */
    V_LDOCORE_HP_1P224 = 22, /*!< 1.224  V */
    V_LDOCORE_HP_1P217 = 23, /*!< 1.217  V */
    V_LDOCORE_HP_1P210 = 24, /*!< 1.21   V */
    V_LDOCORE_HP_1P204 = 25, /*!< 1.204  V */
    V_LDOCORE_HP_1P197 = 26, /*!< 1.197  V */
    V_LDOCORE_HP_1P190 = 27, /*!< 1.19   V */
    V_LDOCORE_HP_1P183 = 28, /*!< 1.183  V */
    V_LDOCORE_HP_1P177 = 29, /*!< 1.177  V */
    V_LDOCORE_HP_1P169 = 30, /*!< 1.169  V */
    V_LDOCORE_HP_1P163 = 31, /*!< 1.163  V */
    V_LDOCORE_HP_1P156 = 32, /*!< 1.156  V */
    V_LDOCORE_HP_1P149 = 33, /*!< 1.149  V */
    V_LDOCORE_HP_1P143 = 34, /*!< 1.143  V */
    V_LDOCORE_HP_1P136 = 35, /*!< 1.136  V */
    V_LDOCORE_HP_1P129 = 36, /*!< 1.129  V */
    V_LDOCORE_HP_1P122 = 37, /*!< 1.122  V */
    V_LDOCORE_HP_1P116 = 38, /*!< 1.116  V */
    V_LDOCORE_HP_1P109 = 39, /*!< 1.109  V */
    V_LDOCORE_HP_1P102 = 40, /*!< 1.102  V */
    V_LDOCORE_HP_1P095 = 41, /*!< 1.095  V */
    V_LDOCORE_HP_1P088 = 42, /*!< 1.088  V */
    V_LDOCORE_HP_1P082 = 43, /*!< 1.082  V */
    V_LDOCORE_HP_1P075 = 44, /*!< 1.075  V */
    V_LDOCORE_HP_1P068 = 45, /*!< 1.068  V */
    V_LDOCORE_HP_1P062 = 46, /*!< 1.062  V */
    V_LDOCORE_HP_1P055 = 47, /*!< 1.055  V */
    V_LDOCORE_HP_1P048 = 48, /*!< 1.048  V */
    V_LDOCORE_HP_1P041 = 49, /*!< 1.041  V */
    V_LDOCORE_HP_1P034 = 50, /*!< 1.034  V */
    V_LDOCORE_HP_1P027 = 51, /*!< 1.027  V */
    V_LDOCORE_HP_1P021 = 52, /*!< 1.021  V */
    V_LDOCORE_HP_1P014 = 53, /*!< 1.014  V */
    V_LDOCORE_HP_1P007 = 54, /*!< 1.007  V */
    V_LDOCORE_HP_1P001 = 55, /*!< 1.001  V */
    V_LDOCORE_HP_0P993 = 56, /*!< 0.9937 V */
    V_LDOCORE_HP_0P987 = 57, /*!< 0.987  V */
    V_LDOCORE_HP_0P980 = 58, /*!< 0.9802 V */
    V_LDOCORE_HP_0P973 = 59, /*!< 0.9731 V */
    V_LDOCORE_HP_0P966 = 60, /*!< 0.9666 V */
    V_LDOCORE_HP_0P959 = 61, /*!< 0.9598 V */
    V_LDOCORE_HP_0P953 = 62, /*!< 0.9532 V */
    V_LDOCORE_HP_0P946 = 63, /*!< 0.946  V */
    V_LDOCORE_HP_0P939 = 64, /*!< 0.9398 V */
    V_LDOCORE_HP_0P932 = 65, /*!< 0.9327 V */
    V_LDOCORE_HP_0P926 = 66, /*!< 0.9262 V */
    V_LDOCORE_HP_0P919 = 67, /*!< 0.9199 V */
    V_LDOCORE_HP_0P913 = 68, /*!< 0.9135 V */
    V_LDOCORE_HP_0P907 = 69, /*!< 0.9071 V */
    V_LDOCORE_HP_0P901 = 70, /*!< 0.9012 V */
    V_LDOCORE_HP_0P895 = 71, /*!< 0.8953 V */
    V_LDOCORE_HP_0P889 = 72, /*!< 0.8895 V */
    V_LDOCORE_HP_0P883 = 73, /*!< 0.8837 V */
    V_LDOCORE_HP_0P877 = 74, /*!< 0.8779 V */
    V_LDOCORE_HP_0P871 = 75, /*!< 0.8719 V */
    V_LDOCORE_HP_0P865 = 76, /*!< 0.8658 V */
    V_LDOCORE_HP_0P859 = 77, /*!< 0.8596 V */
    V_LDOCORE_HP_0P853 = 78, /*!< 0.8537 V */
    V_LDOCORE_HP_0P847 = 79, /*!< 0.8474 V */
    V_LDOCORE_HP_0P841 = 80, /*!< 0.8413 V */
    V_LDOCORE_HP_0P835 = 81, /*!< 0.835  V */
    V_LDOCORE_HP_0P828 = 82, /*!< 0.8288 V */
    V_LDOCORE_HP_0P822 = 83, /*!< 0.8221 V */
    V_LDOCORE_HP_0P815 = 84, /*!< 0.8158 V */
    V_LDOCORE_HP_0P809 = 85, /*!< 0.8094 V */
    V_LDOCORE_HP_0P802 = 86, /*!< 0.8026 V */
    V_LDOCORE_HP_0P795 = 87, /*!< 0.7959 V */
    V_LDOCORE_HP_0P789 = 88, /*!< 0.7893 V */
    V_LDOCORE_HP_0P782 = 89, /*!< 0.7823 V */
    V_LDOCORE_HP_0P775 = 90, /*!< 0.7756 V */
    V_LDOCORE_HP_0P768 = 91, /*!< 0.7688 V */
    V_LDOCORE_HP_0P762 = 92, /*!< 0.7623 V */
    V_LDOCORE_HP_0P755 = 93, /*!< 0.7558 V */
    V_LDOCORE_HP_0P749 = 94, /*!< 0.749  V */
    V_LDOCORE_HP_0P742 = 95, /*!< 0.7421 V */
    V_LDOCORE_HP_0P735 = 96, /*!< 0.7354 V */
    V_LDOCORE_HP_0P728 = 97, /*!< 0.7284 V */
    V_LDOCORE_HP_0P722 = 98, /*!< 0.722  V */
    V_LDOCORE_HP_0P715 = 99  /*!< 0.715  V */
    //    V_LDOCORE_HP_0P715 = 100, /*!< 0.7148 V */
    //    V_LDOCORE_HP_0P715 = 101, /*!< 0.7148 V */
    //    V_LDOCORE_HP_0P715 = 102, /*!< 0.7151 V */
    //    V_LDOCORE_HP_0P715 = 103, /*!< 0.7147 V */
    //    V_LDOCORE_HP_0P715 = 104, /*!< 0.7147 V */
    //    V_LDOCORE_HP_0P715 = 105, /*!< 0.715  V */
    //    V_LDOCORE_HP_0P715 = 106, /*!< 0.7147 V */
    //    V_LDOCORE_HP_0P715 = 107, /*!< 0.715  V */
    //    V_LDOCORE_HP_0P715 = 108, /*!< 0.7152 V */
    //    V_LDOCORE_HP_0P715 = 109, /*!< 0.7148 V */
    //    V_LDOCORE_HP_0P715 = 110, /*!< 0.715  V */
    //    V_LDOCORE_HP_0P715 = 111, /*!< 0.7151 V */
    //    V_LDOCORE_HP_0P715 = 112, /*!< 0.7153 V */
    //    V_LDOCORE_HP_0P715 = 113, /*!< 0.7152 V */
    //    V_LDOCORE_HP_0P715 = 114, /*!< 0.7149 V */
    //    V_LDOCORE_HP_0P715 = 115, /*!< 0.7154 V */
    //    V_LDOCORE_HP_0P715 = 116, /*!< 0.7152 V */
    //    V_LDOCORE_HP_0P715 = 117, /*!< 0.7154 V */
    //    V_LDOCORE_HP_0P715 = 118, /*!< 0.7147 V */
    //    V_LDOCORE_HP_0P715 = 119, /*!< 0.7152 V */
    //    V_LDOCORE_HP_0P715 = 120, /*!< 0.7149 V */
    //    V_LDOCORE_HP_0P715 = 121, /*!< 0.7151 V */
    //    V_LDOCORE_HP_0P715 = 122, /*!< 0.7152 V */
    //    V_LDOCORE_HP_0P715 = 123, /*!< 0.7153 V */
    //    V_LDOCORE_HP_0P715 = 124, /*!< 0.7149 V */
    //    V_LDOCORE_HP_0P715 = 125, /*!< 0.7154 V */
    //    V_LDOCORE_HP_0P715 = 126, /*!< 0.7153 V */
    //    V_LDOCORE_HP_0P715 = 127, /*!< 0.7154 V */
} v_ldocore_hp_t;

/**
 * @brief LDO_CORE Low Power Mode voltage settings
 */
typedef enum _v_ldocore_lp
{
    V_LDOCORE_LP_0P750 = 3, /*!< 0.75  V */
    V_LDOCORE_LP_0P800 = 2, /*!< 0.8   V */
    V_LDOCORE_LP_0P850 = 1, /*!< 0.85  V */
    V_LDOCORE_LP_0P900 = 0  /*!< 0.9   V */
} v_ldocore_lp_t;

/**
 * @brief System Power Mode settings
 */
typedef enum _v_system_power_profile
{
    V_SYSTEM_POWER_PROFILE_LOW    = 0UL, /*!< For system below or equal to 100 MHz */
    V_SYSTEM_POWER_PROFILE_MEDIUM = 1UL, /*!< For system frequencies in ]100 MHz - 150 MHz] */
    V_SYSTEM_POWER_PROFILE_HIGH   = 2UL, /*!< For system above 150 MHz */
} v_system_power_profile_t;

/**
 * @brief Manufacturing Process Corners
 */
typedef enum
{
    PROCESS_CORNER_SSS,    /**< Slow Corner Process */
    PROCESS_CORNER_NNN,    /**< Nominal Corner Process */
    PROCESS_CORNER_FFF,    /**< Fast Corner Process */
    PROCESS_CORNER_OTHERS, /**< SFN, SNF, NFS, Poly Res ... Corner Process */
} lowpower_process_corner_enum;

/** @brief  Low Power main structure */
typedef struct
{
    __IO uint32_t CFG;          /*!< Low Power Mode Configuration, and miscallenous options  */
    __IO uint32_t PDCTRL[2];    /*!< Power Down control : controls power of various modules
                                 in the different Low power modes, including ROM */
    __IO uint32_t SRAMRETCTRL;  /*!< Power Down control : controls power SRAM instances
                                 in the different Low power modes */
    __IO uint32_t CPURETCTRL;   /*!< CPU0 retention control : controls CPU retention parameters in POWER DOWN modes */
    __IO uint64_t VOLTAGE;      /*!< Voltage control in Low Power Modes */
    __IO uint32_t WAKEUPSRC[4]; /*!< Wake up sources control for sleepcon */
    __IO uint32_t WAKEUPINT[4]; /*!< Wake up sources control for ARM */
    __IO uint32_t HWWAKE;       /*!< Interrupt that can postpone power down modes
                                 in case an interrupt is pending when the processor request deepsleep */
    __IO uint32_t WAKEUPIOSRC;  /*!< Wake up I/O sources in DEEP POWER-DOWN mode */
} LPC_LOWPOWER_T;

#ifdef LPC55S36_SERIES
/**
 * @brief NMPA related Registers
 */
#define FLASH_NMPA_BOD_LDOCORE                      (*((volatile unsigned int *)(0x3FC08)))
#define FLASH_NMPA_DCDC_POWER_PROFILE_LOW_ARRAY0    (*((volatile unsigned int *)(0x3FC18)))
#define FLASH_NMPA_DCDC_POWER_PROFILE_LOW_ARRAY1    (*((volatile unsigned int *)(0x3FC1C)))
#define FLASH_NMPA_LDO_AO                           (*((volatile unsigned int *)(0x3FC24)))
#define FLASH_NMPA_LDO_MEM                          (*((volatile unsigned int *)(0x3FD60)))
#define FLASH_NMPA_DCDC_POWER_PROFILE_HIGH_ARRAY0   (*((volatile unsigned int *)(0x3FCB0)))
#define FLASH_NMPA_DCDC_POWER_PROFILE_HIGH_ARRAY1   (*((volatile unsigned int *)(0x3FCB4)))
#define FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_ARRAY0 (*((volatile unsigned int *)(0x3FCB8)))
#define FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_ARRAY1 (*((volatile unsigned int *)(0x3FCBC)))
#define FLASH_NMPA_PVT_MONITOR_0_RINGO              (*((volatile unsigned int *)(0x3FCE0)))
#define FLASH_NMPA_PVT_MONITOR_1_RINGO              (*((volatile unsigned int *)(0x3FCF0)))

/**
 * @brief NMPA related masks
 */

#define FLASH_NMPA_BOD_LDOCORE_REGREF_1P8V_OFFSET_SHIFT (24U)
#define FLASH_NMPA_BOD_LDOCORE_REGREF_1P8V_OFFSET_MASK  (0xFF000000U)
#define FLASH_NMPA_LDO_AO_VADJ_ACTIVE_SHIFT             (0U)
#define FLASH_NMPA_LDO_AO_VADJ_ACTIVE_MASK              (0xFFU)
#endif

/**
 * @brief CSS related Registers
 */
#define CSSV2_STATUS_REG            (*((volatile unsigned int *)(0x40030000)))
#define CSSV2_CTRL_REG              (*((volatile unsigned int *)(0x40030004)))
#define SYSCON_CSS_CLK_CTRL_REG     (*((volatile unsigned int *)(0x400009B0)))
#define SYSCON_CSS_CLK_CTRL_SET_REG (*((volatile unsigned int *)(0x400009B4)))
#define SYSCON_CSS_CLK_CTRL_CLR_REG (*((volatile unsigned int *)(0x400009B8)))

/**
 * @brief Wake-up I/O positions
 */
/*!< wake-up 0 */
#define WAKEUPIO_0_PORT (1UL)
#define WAKEUPIO_0_PINS (1UL)
/*!< wake-up 1 */
#define WAKEUPIO_1_PORT (0UL)
#define WAKEUPIO_1_PINS (28UL)
/*!< wake-up 2 */
#define WAKEUPIO_2_PORT (1UL)
#define WAKEUPIO_2_PINS (18UL)
/*!< wake-up 3 */
#define WAKEUPIO_3_PORT (1UL)
#define WAKEUPIO_3_PINS (30UL)
/*!< wake-up 4 */
#define WAKEUPIO_4_PORT (0UL)
#define WAKEUPIO_4_PINS (26UL)

/**
 * @brief SRAM Low Power Modes
 */
#define LOWPOWER_SRAM_LPMODE_MASK      (0xFUL)
#define LOWPOWER_SRAM_LPMODE_ACTIVE    (0x6UL) /*!< SRAM functional mode                                */
#define LOWPOWER_SRAM_LPMODE_SLEEP     (0xFUL) /*!< SRAM Sleep mode (Data retention, fast wake up)      */
#define LOWPOWER_SRAM_LPMODE_DEEPSLEEP (0x8UL) /*!< SRAM Deep Sleep mode (Data retention, slow wake up) */
#define LOWPOWER_SRAM_LPMODE_SHUTDOWN  (0x9UL) /*!< SRAM Shut Down mode (no data retention)             */
#define LOWPOWER_SRAM_LPMODE_POWERUP   (0xAUL) /*!< SRAM is powering up                                 */

/**
 * @brief SoC Low Power modes
 */
#define LOWPOWER_CFG_LPMODE_INDEX          0
#define LOWPOWER_CFG_LPMODE_MASK           (0x3UL << LOWPOWER_CFG_LPMODE_INDEX)
#define LOWPOWER_CFG_SELCLOCK_INDEX        2
#define LOWPOWER_CFG_SELCLOCK_MASK         (0x1UL << LOWPOWER_CFG_SELCLOCK_INDEX)
#define LOWPOWER_CFG_SELMEMSUPPLY_INDEX    3
#define LOWPOWER_CFG_SELMEMSUPPLY_MASK     (0x1UL << LOWPOWER_CFG_SELMEMSUPPLY_INDEX)
#define LOWPOWER_CFG_MEMLOWPOWERMODE_INDEX 4
#define LOWPOWER_CFG_MEMLOWPOWERMODE_MASK  (0x1UL << LOWPOWER_CFG_MEMLOWPOWERMODE_INDEX)
#define LOWPOWER_CFG_LDODEEPSLEEPREF_INDEX 5
#define LOWPOWER_CFG_LDODEEPSLEEPREF_MASK  (0x1UL << LOWPOWER_CFG_LDODEEPSLEEPREF_INDEX)

#define LOWPOWER_CFG_LPMODE_ACTIVE        0 /*!< ACTIVE mode */
#define LOWPOWER_CFG_LPMODE_DEEPSLEEP     1 /*!< DEEP-SLEEP mode */
#define LOWPOWER_CFG_LPMODE_POWERDOWN     2 /*!< POWER-DOWN mode */
#define LOWPOWER_CFG_LPMODE_DEEPPOWERDOWN 3 /*!< DEEP POWER-DOWN mode */
#define LOWPOWER_CFG_LPMODE_SLEEP         4 /*!< SLEEP mode */

